/* exported 
DICT_COMMON SETTINGS EMOJI_IMAGES
CATEGORY_PRICES OBJ_CATEGORIES 
EFFECT_LISTS DEFAULT 
MAX_UNIT_HP MAP_PATH POP_PROP 
TECH_EFFECTS
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW KW_RULES
*/

const CELL_SIZE = 120

const SETTINGS = {
  IS_CUSTOM: true,
  MAP_PATH: 'stars/map.png',
  // DEFAULT_FIGURE_BG: 'circle',

  MAX_UNIT_HP: 3,
  VISION_RADIUS: CELL_SIZE * 1.5,
  CAPITAL_SPECIAL_VISION: false,
  // may be left empty, then _pop_ wont be applied
  POP_PROP: null,
  // NO_GRAVES: true, 

  MAX_TECH_LVL: 3,
  // DEFAULT_LINE_COLOR: 'white',
  // TITLE_ABOVE: true,
  CANNOT_ACT_AFTER_PLACEMENT: true,
} 


const DEFAULT = {
  /* filled up later */
  buildings: [],
  /* filled up later */
  units: [],
  noHealth: [
    // KW.BUILD_SLOT,
    KW.GRAVE_UNIT,
    KW.WRECK_UNIT,
    // '_unknown_bonus',
  ],
  wreckUnit: [
  ],
  noGrave: [
  ],
  noUpkeep: [
  ],
}

const EMOJI_IMAGES = {
  [KW.GRAVE_UNIT]: '💀',
  [KW.WRECK_UNIT]: '🔩',

  // персонажи
  "Пси-клинок": "⚔️",
  "Созерцатель": "👁️",
  "Кровотворец": "🙌",
  "Хранитель": "🎓",

  // враги
  "Тень_Усопшего":"👤",
  "Огонёк-искуситель":"😈",
  "Костяной_паук":"🕷️",
  "Холодный_свет":"🌟",

  "Звёздный_зомби":"🧟",
  "Удав_Пустоты":"🐍",
  "Демон-диверсант":"👹",

  // "Лёгкие_Станции":"🕳️",
  // "Король_Склепа":"💀👑",
  "Око_Аннигиляции":"👁️",
  
  // предметы
  "Скрижаль":"📜",
  "Кристалл_души":"💎",

  // оружие
  "Парализующий_амулет": "⚡", 
  "Соляная_граната": "🧂",
  "Соль": "◽◽",
  "Переносной_Алтарь": "🕯️",
  "Кровемёт": "🔫", //📣
  "Бомба": "💣",

  // Медицина и защита
  "Инъектор_подавления": "💉",
  "Коагулянт-гель": "🩹",
  "Дыхательная_маска": "🤿",
  "Пси-сканер": "🧿",
  
  // инженерия
  "Ремонтный_набор": "🛠️",
  "Аварийный_накопитель": "🔋",
  "Копир-скрижаль": "📋", // 📜🔍

  // исследовательское
  "Пробник_Колодца": "🧪",
  "Спиритический_микрофон": "💬",

  // здания
  "Центр_управления":"🧠",
  "Контрольное_кресло":"🪑",
  "Карта_корабля":"🗺️",

  "Центр_связи":"📡",
  "Контур_ответчик":"↪️",

  "Движетель":"☀️",
  "Цепи_движетеля":"⛓️",

  "Алтарь_Покоя":"🕯️",
  "Обсерватория_Пустоты":"🌌", //🪐
  "Жилая_секция":"🏡",
  "Кровать":"🛏️",
  "Целительная":"⚕️", //🩺
  
  "Кровоточащий_Колодец":"♥️",
  "Кровь_колодца": "🩸",

  "Чертог_Скрижалей":"📚",
  "Душевидец":"♾️",

  "Пульсар_Душ":"🔮",
  "Провод1":"🔵",
  "Провод2":"🟣",
  "Оранжерея":"🌿",
  "Дерево":"🌴",

  "Портальный_чертог":"⏩",
  "Звёздная_Арка":"💫",
  "Закрытая_дверь":"🔒",

  "Обзор":"👁️‍🗨️",
  
  "Разрыв":"🕳️",
}

const WEATHER_EFF = {}

/** usually it means prices */
const OBJ_CATEGORIES = {
  UNITS: {
    // _none_: [
    // ],
    // _default_: [
    // ],
    Персонажи: [
      "Пси-клинок",
      "Созерцатель",
      "Кровотворец",
      "Хранитель",
    ],
    Предметы: [
      "Скрижаль",
      "Кристалл_души",

      // оружие
      "Парализующий_амулет",
      "Соляная_граната",
      "Соль",
      "Переносной_Алтарь",
      "Кровемёт",
      "Бомба",

      // Медицина и защита
      "Инъектор_подавления",
      "Коагулянт-гель",
      "Дыхательная_маска",
      "Пси-сканер",

      // инженерия
      "Ремонтный_набор",
      "Аварийный_накопитель",
      "Копир-скрижаль",

      // исследовательское
      "Пробник_Колодца",
      "Спиритический_микрофон",
    ],
    Враги: [
      "Тень_Усопшего",
      "Огонёк-искуситель",
      "Костяной_паук",
      "Холодный_свет",

      "Звёздный_зомби",
      "Удав_Пустоты",
      "Демон-диверсант",

      "Око_Аннигиляции",
    ],
  },
  BUILDINGS: {
    _none_: [
      KW.GRAVE_UNIT,
      KW.WRECK_UNIT,
    ],
    _default_: [
      "Центр_управления",
      "Центр_связи",
      
      "Движетель",
      
      "Алтарь_Покоя",
      "Обсерватория_Пустоты",
      "Жилая_секция",
      "Целительная",
      
      "Кровоточащий_Колодец",
      
      "Чертог_Скрижалей",
      "Пульсар_Душ",
      "Оранжерея",
      "Портальный_чертог",
      
    ],
    Устройства: [
      "Обзор",
      "Душевидец",
      "Контур_ответчик",
      "Карта_корабля",
      "Закрытая_дверь",
      "Звёздная_Арка",
    ],
    Декор: [
      "Контрольное_кресло",
      "Цепи_движетеля",
      "Дерево",
      "Провод1",
      "Провод2",
      "Кровать",
      "Кровь_колодца",

      "Разрыв",
    ],
  }
}

DEFAULT.noHealth = DEFAULT.noHealth.concat(OBJ_CATEGORIES.UNITS.Предметы)
DEFAULT.noHealth = DEFAULT.noHealth.concat(OBJ_CATEGORIES.BUILDINGS.Декор)

const CATEGORY_PRICES = {
  UNITS: {
    _default_: [], 
  },
  BUILDINGS: {
    _default_: [],
  }
}

const EFFECT_LISTS = {
  // статичные эффекты, нам важно текущее значение
  static: [
  ],
  // добывается, фактически показывает прибыль ресурса
  resources: [
    // "Рабы",
  ],
  local: [
    KW.ATK,
    KW.DEF,
    KW.AP,
    KW.DIST,
    "ХП",
    KW.REGEN,
    ...KW_LOCALS
  ],
}

const DICT_COMMON = {
  '_upkeep_': {
    '_building_': {
    },
    '_unit_': {
      // Снабжение: -1,
    }
  },

  '_building_': {
  },
  '_unit_': {
  },

  [KW.WRECK_UNIT]: {
  },

  // здания

  'Обзор': {
    [KW.VISION]: CELL_SIZE * 1.6
  },

  'Соль': {
    [KW.LVL_DRIFT]: -1,
  },

  'Закрытая_дверь': {
    [KW.INIT_HP]: 6,
    [KW.MAX_HP]: 6,
  },
};

KW_RULES.setCommon(
  OBJ_CATEGORIES.BUILDINGS.Устройства,
  { [KW.VISION]: KW.NO_VISION }
)

KW_RULES.setCommon(
  OBJ_CATEGORIES.UNITS.Персонажи,
  {
    [KW.VISION]: CELL_SIZE * 1.8, 
    "Экипаж": 1,
  }
)

const TECH_EFFECTS = {}