/* exported
DICT_USER USER_TECH_LVLS
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW
*/

const DICT_USER = {

  Десант: {
    "Столица":
      [
        ["Холодная_родина", 1],
      ],
    "Фрегат":
      [
        ["ОО", 3],
        ["Б", 2],
      ],
    // "Газовый_гигант":
    //   [
    //     ["Уран", 100]
    //   ],
  },

};

const USER_TECH_LVLS = {
  Десант: {
    Энергетика: 0,
    Двигатели: 0,
    Социология: 0,
    Биология: 0,
    Оружие: 0,
    Броня: 0,
    "Энерго-оружие": 0,
    Щиты: 0,
  },
}
