/* exported
FACTIONS DICT_USER USER_TECH_LVLS
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW
*/

/** colors only in lowercase! */
const FACTIONS = {
  "Нейтралы": "#d3d3d3",
  "Варвары": "#930000",
  "МСФК": "#0000ff",
  "КуртАльф": "#7fffee",
  "Колорады": "#008000",
};

var DICT_USER = {

  МСФК: {
    "Столица":
      [
        ["Холодная_родина", 1],
        ["Сила ОО", 1],
        ["Сила Б", 1],
      ],
    "Фрегат":
      [
        ["ОО", 3],
        ["Б", 2],
      ],
  },
  КуртАльф: {
    "Столица":
      [
        ["Водная_родина", 1],
      ],
    "Развивающаяся_колония":
      [
        ["Наука", 1],
      ],
    "Развитая_колония":
      [
        ["Наука", 1],
      ],
    "Мир-кузница":
      [
        ["Наука", 1],
      ],
    "Фрегат":
      [
        ["ОО", 3],
        ["Б", 2],
      ],
  },
  Колорады: {
    "Столица":
      [
        ["Горячая_родина", 1],
      ],
    "Фрегат":
      [
        ["ОО", 3],
        ["Б", 2],
      ],
  },

};
