/* exported 
DICT_COMMON SETTINGS EMOJI_IMAGES
CATEGORY_PRICES OBJ_CATEGORIES 
EFFECT_LISTS DEFAULT 
MAX_UNIT_HP MAP_PATH POP_PROP 
TECH_EFFECTS
onEndTurnCb
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW KW_LOCALS
*/

/// <reference path="../../index.js"/>
/* global
USER_RESOURCES
NPCPlayers listPlayers
userEffectsObj
*/

const CELL_SIZE = 90

const SETTINGS = {
  IS_CUSTOM: true,
  MAP_PATH: 'rl-sbor/map.png',
  // DEFAULT_FIGURE_BG: 'circle',

  MAX_UNIT_HP: 1,
  VISION_RADIUS: CELL_SIZE * 1.6,
  CAPITAL_SPECIAL_VISION: false,
  // may be left empty, then _pop_ wont be applied
  POP_PROP: null,
  NO_GRAVES: true, 

  MAX_TECH_LVL: 3,
  DEFAULT_LINE_COLOR: 'white',
  CANNOT_ACT_AFTER_PLACEMENT: true,
} 

const DEFAULT = {
  /* filled up later */
  buildings: [],
  /* filled up later */
  units: [],
  noHealth: [
    KW.GRAVE_UNIT,
    KW.WRECK_UNIT,
    // '_unknown_bonus',
  ],
  wreckUnit: [
  ],
  noGrave: [
  ],
  noUpkeep: [
    KW.GRAVE_UNIT,
  ],
}

// https://en.wikipedia.org/wiki/List_of_emojis
// https://emojipedia.org/fantasy-magic
const EMOJI_IMAGES = {
  "Мэр города": "👑",
  "Казначей": "💰",
  "Сборщик налогов": "📜",
  "Глашатай": "📯",
  "Инспектор короля": "🕵️‍♂️",
  "Гонец из столицы": "🐎",
  "Охранник мэрии": "🛡️",
  "Полководец": "🎖️",
  "Стражник": "🏹",
  "Глава Семьи": "💍",
  "Жена главы Семьи": "🌹",
  "Старшая дочь": "📚",
  "Средняя дочь": "🔥",
  "Младшая дочь": "🧸",
  "Почтенный дедушка": "🦯",
  "Троюродная тетушка": "❄️",
  "Телохранитель": "🥊",
  "Архиепископ": "✝️",
  "Священник": "🕯️",
  "Инквизитор": "🔨",
  "Торговец": "🏷️",
  "Караванщик": "🐪",
  "Охранник торгового дома": "🦮",
  "Настоятельница приюта": "🗝️",
  "Помощница настоятельницы": "🥣",
  "Работник приюта": "🧹",
  "Житель города": "👨‍🌾",
  "Местный житель/проповедница": "📢",
  "Кабатчик": "🍺",
  "Монстр/Маркус": "👹",
  "Привратник": "🚪",
  "Мастер мертвятника": "💀",
  "Помощник": "🧟",
  "Мясник": "🪓",
  "Маг": "✨",
  "Босс": "👾",
  "Глава семьи": "🏰",
  "Мастер прокаженных": "☣️",
  "Епископ": "✝️",
  "Дикая прокаженная": "🐺"
}

/** usually it means prices */
const OBJ_CATEGORIES = {
  UNITS: {
    _default_: [
    ],
    "Мэрия": [
      "Мэр города",
      "Казначей",
      "Сборщик налогов",
      "Глашатай",
      "Инспектор короля",
      "Гонец из столицы",
      "Охранник мэрии"
    ],
    "Городская армия": [
      "Полководец",
      "Стражник"
    ],
    "Семья Грюневальд": [
      "Глава Семьи",
      "Жена главы Семьи",
      "Старшая дочь",
      "Средняя дочь",
      "Младшая дочь",
      "Почтенный дедушка",
      "Троюродная тетушка",
      "Телохранитель"
    ],
    "Церковь Святого Христофора": [
      "Архиепископ",
      "Священник",
      "Инквизитор"
    ],
    "Торговый дом": [
      "Торговец",
      "Караванщик",
      "Охранник торгового дома"
    ],
    "Сиротский приют": [
      "Настоятельница приюта",
      "Помощница настоятельницы",
      "Работник приюта"
    ],
    "Жители города": [
      "Житель города"
    ],
    "Игротехи": [
      "Местный житель/проповедница",
      "Кабатчик",
      "Монстр/Маркус",
      "Привратник",
      "Мастер мертвятника",
      "Помощник",
      "Мясник",
      "Маг",
      "Босс",
      "Глава семьи",
      "Мастер прокаженных",
      "Епископ",
      "Дикая прокаженная"
    ]
  },
  BUILDINGS: {
    // _none_: [
    //   // KW.GRAVE_UNIT,
    //   // KW.WRECK_UNIT,
    //   // '_unknown_bonus',
    // ],
    _default_: [
    ],
  }
}

const CATEGORY_PRICES = {
  UNITS: {
    _default_: [
      // ['Обычное_производство', -1]
    ], 
    элитные: [
      // ['Элитное_производство', -1]
    ], 
  },
  BUILDINGS: {
    _default_: [
    ],
    пристройки: [
    ],
  }
}

const EFFECT_LISTS = {
  // статичные эффекты, нам важно текущее значение
  static: [
    'Снабжение',
  ],
  // добывается, фактически показывает прибыль ресурса
  resources: [
    "Минералы",
  ],
  local: [
    ...KW_LOCALS,
    "Производство",
    "Элитное_производство",
    "Строитель",
    "Рентген",
  ],
}

const UNIT_UPKEEP = 1
const UNDO_POP_USAGE = ['Рабочие', 1]
const DICT_COMMON = {
  // "Пешка": {
  //   [KW.COST]: {
  //     Минералы: 1,
  //   },
  //   [KW.VISION]: CELL_SIZE,
  //   Строитель: 1,
  // },
}

const onEndTurnCb = () => {
  // for(let player of listPlayers()) {
  //   if(NPCPlayers.includes(player)) continue
  //   const sum = userEffectsObj.sumPlayerEffects(player)
  //   for(let [effName, v] of Object.entries(sum)) {
  //     if(EFFECT_LISTS.resources.includes(effName)) {
  //       if(typeof USER_RESOURCES[player][effName] !== 'number') {
  //         USER_RESOURCES[player][effName] = 0
  //       }
  //       if(USER_RESOURCES[player][effName] + +v < 0) {
  //         USER_RESOURCES[player][effName] = 0
  //         continue
  //       }
  //       USER_RESOURCES[player][effName] += +v
  //     }

  //   }
  // }
}

const onPlayerEffectChangeCb = (player, effs) => {
  // if (effs.Снабжение < 0) {
  //   alert(`Игрок ${player}: нехватка Снабжения (${effs.Снабжение})`)
  // }
}

const TECH_EFFECTS = {
  "Мэрия": {
    1: [
      "Юнит: Мэр города",
      "Юнит: Казначей",
      "Юнит: Сборщик налогов",
      "Юнит: Глашатай",
      "Юнит: Инспектор короля",
      "Юнит: Гонец из столицы",
      "Юнит: Охранник мэрии"
    ]
  },
  "Городская армия": {
    1: [
      "Юнит: Полководец",
      "Юнит: Стражник"
    ]
  },
  "Семья Грюневальд": {
    1: [
      "Юнит: Глава Семьи",
      "Юнит: Жена главы Семьи",
      "Юнит: Старшая дочь",
      "Юнит: Средняя дочь",
      "Юнит: Младшая дочь",
      "Юнит: Почтенный дедушка",
      "Юнит: Троюродная тетушка",
      "Юнит: Телохранитель"
    ]
  },
  "Церковь Святого Христофора": {
    1: [
      "Юнит: Архиепископ",
      "Юнит: Священник",
      "Юнит: Инквизитор"
    ]
  },
  "Торговый дом": {
    1: [
      "Юнит: Торговец",
      "Юнит: Караванщик",
      "Юнит: Охранник торгового дома"
    ]
  },
  "Сиротский приют": {
    1: [
      "Юнит: Настоятельница приюта",
      "Юнит: Помощница настоятельницы",
      "Юнит: Работник приюта"
    ]
  },
  "Жители города": {
    1: [
      "Юнит: Житель города"
    ]
  },
  "Игротехи": {
    1: [
      "Юнит: Местный житель/проповедница",
      "Юнит: Кабатчик",
      "Юнит: Монстр/Маркус",
      "Юнит: Привратник",
      "Юнит: Мастер мертвятника",
      "Юнит: Помощник",
      "Юнит: Мясник",
      "Юнит: Маг",
      "Юнит: Босс",
      "Юнит: Глава семьи",
      "Юнит: Мастер прокаженных",
      "Юнит: Епископ",
      "Юнит: Дикая прокаженная"
    ]
  }
}