/* exported
FACTIONS DICT_USER USER_TECH_LVLS
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW
*/

/** colors only in lowercase! */
const FACTIONS = {
  "Мэрия": "#006699",
  "Армия": "#990000",
  "Семья": "#006600",
  "Церковь": "#996600",
  "Торговцы": "#660066",
  "Приют": "#333333",
  "Жители": "#cc6600",
  "Игротехи": "#009999"
}

const DICT_USER = {
  Нью_Лоуландс: {
    [KW.CAPITAL]:
      [
      ],
  },
};

const USER_TECH_LVLS = {
  Мэрия: {
    "Мэрия": 1
  },
  Армия: {
    "Городская армия": 1
  },
  Семья: {
    "Семья Грюневальд": 1
  },
  Церковь: {
    "Церковь Святого Христофора": 1
  },
  Торговцы: {
    "Торговый дом": 1
  },
  Приют: {
    "Сиротский приют": 1
  },
  Игротехи: {
    "Игротехи": 1
  },
  Жители: {
    "Жители города": 1
  },
}
