/* exported
DICT_USER USER_TECH_LVLS
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW
*/

const DICT_USER = {
  Нью_Лоуландс: {
    [KW.CAPITAL]:
      [
      ],
  },
};

const USER_TECH_LVLS = {
  Мэрия: {
    "Мэрия": 1
  },
  Армия: {
    "Городская армия": 1
  },
  Семья: {
    "Семья Грюневальд": 1
  },
  Церковь: {
    "Церковь Святого Христофора": 1
  },
  Торговцы: {
    "Торговый дом": 1
  },
  Приют: {
    "Сиротский приют": 1
  },
  Игротехи: {
    "Игротехи": 1
  },
  Жители: {
    "Жители города": 1
  },
}
