/* exported 
DICT_COMMON 
CATEGORY_PRICES OBJ_CATEGORIES 
EFFECT_LISTS DEFAULT 
MAX_UNIT_HP MAP_PATH POP_PROP 
TECH_EFFECTS
*/

/// <reference path="../src/keywords.js"/>
/* global
KW
*/

const MAP_PATH = './map/bnb/bnb.png'

const MAX_UNIT_HP = 10

// may be left empty, then _pop_ wont be applied
const POP_PROP = 'Население'

const DEFAULT = {
  /* filled up later */
  buildings: [],
  /* filled up later */
  units: [],
  noHealth: [
    'build_slot',
    KW.GRAVE_UNIT,
    KW.WRECK_UNIT,
    '_unknown_bonus',
    '_Маркер_недовольства',
  ],
  wreckUnit: [
    'Корабль_1',
    'Корабль_2',
    'Корабль_3',
    'Баллиста',
    'Катапульта',
    'Танк_Леонардо',
  ],
  noGrave: [
  ],
  noUpkeep: [
    'Скот',
    'Баллиста',
    'Катапульта',

    KW.CAPITAL,
    'Стена',
  ],
}

const WEATHER_EFF = {}

const CATEGORY_PRICES = {
  UNITS: {
    _default_: [
      ['Население', 3],
      ['Железо', 1],
    ],
    Скот: [
      ['Еда', 4],
    ],
    Корабль: [
      ['Население', 'ЛВЛ'],
      ['Дерево', 'ЛВЛ*2'],
      ['Железо', 'ЛВЛ'],
    ],
    Осадная_машина: [
      ['Дерево', 4],
      ['Железо', 2],
    ],
  },
  BUILDINGS: {
    _default_: [
      ['Дерево', 5],
      // ['Железо', 1],
    ],
    Аванпост: [
      ['Дерево', 15],
    ],
    Город: [
      ['Дерево', 60],
      ['Население', 3],
    ],
  }
}

const OBJ_CATEGORIES = {
  UNITS: {
    _none_: [
      'default_unit',
      // 'Жители',
    ],
    _default_: [

      'Пехота',
      'Стрелки',
      'Щитовик',
      'Разведчики',
      'Инженеры',
      
      // 'Танк_Леонардо',

      // 'Элита',
      // 'Демон',
      // 'Командир',
    ],
    Скот: [
      'Скот',
      'Кони',
      'Зверь',
      // 'Лютый_зверь',
      // 'Царь_птица',
    ],
    Осадная_машина: [
      'Баллиста',
      'Катапульта',
    ],
    Корабль: [
      'Корабль_1',
      'Корабль_2',
      'Корабль_3',
    ],
  },
  BUILDINGS: {
    _none_: [
      '_build_slot',
      KW.GRAVE_UNIT,
      KW.WRECK_UNIT,
      '_unknown_bonus',
      '_Маркер_недовольства',
      // 'Дорога',
    ],
    _default_: [

      KW.CAPITAL,

      // 'Дороги',
      'Стена',
      
      'Охотник',
      'Ферма',
      'Железная_шахта',
      'Лесопилка',
      'Сад',
      
      'Кузница',
      'Порт',
      // 'Казарма',

      // 'Фабрика',
    ],
    Город: [
      'Город',
    ],
    Аванпост: ['Аванпост'],
  }
}

DEFAULT.units = Object.values(OBJ_CATEGORIES.UNITS).flat()
DEFAULT.buildings = Object.values(OBJ_CATEGORIES.BUILDINGS).flat()

const EFFECT_LISTS = {
  // статичные эффекты, нам важно текущее значение
  static: [
    // 'Лимит населения',
    'unit_count',
    'build_count',
    'unit_to_upkeep',
    'build_to_upkeep',

    'Население',
    'Недовольство',
    'Рабочие',
  ],
  // добывается, фактически показывает прибыль ресурса
  resources: [
    "Еда",
    "Железо",
    "Дерево",
    "Рабы",
    // "Лошади",
  ],
  local: [
    KW.ATK,
    KW.DEF,
    KW.AP,
    KW.DIST,
    "ХП",
    KW.REGEN,
  ],
}

const UNIT_UPKEEP = 3
const UNDO_POP_USAGE = ['Рабочие', 1]
const DICT_COMMON = {
  _upkeep_: {
    _building_: [
      ['Рабочие', -1],
    ],
    _unit_: [
      ["Еда", -UNIT_UPKEEP],
    ],
  },
  _building_: [
    [KW.REGEN, 2],
  ],
  _unit_: [
    [KW.ATK, 0],
    [KW.DEF, 0],
  ],
  _pop_: [
    ["Еда", -0.5],
  ],
  [KW.CAPITAL]:
    [
      [POP_PROP, '+ЛВЛ'],
      ["Еда", 25],
      ["Дерево", 3],
    ],

  Город:
    [
      UNDO_POP_USAGE,
      [POP_PROP, '+ЛВЛ'],
    ],

  Аванпост:
    [
      // [POP_PROP, '+ЛВЛ'],
    ],

  Стена:
    [
    ],

  _Маркер_недовольства:
    [
      UNDO_POP_USAGE,
      ['Недовольство', '+ЛВЛ'],
      [KW.LVL_DRIFT, -1],
    ],

  Железная_шахта:
    [
      ["Железо", 1],
      ["Дерево", -1],
    ],

  Лесопилка:
    [
      ["Дерево", 3],
    ],

  Сад:
    [
      ["Еда", -1],
      ["Дерево", 2],
    ],

  Ферма:
    [
      ["Еда", 4],
    ],

  Охотник:
    [
      ["Еда", 2],
    ],

  //////////////// units

  Пехота: [
    [KW.ATK, 2],
    [KW.DEF, 2],
    [KW.AP, 2],
  ],
  Стрелки: [
    [KW.ATK, 2],
    [KW.DEF, 1],
    [KW.AP, 2],
    [KW.DIST, 1],
  ],
  Щитовик: [
    [KW.ATK, 2],
    [KW.DEF, 3],
    [KW.AP, 1],
  ],
  Разведчики: [
    [KW.ATK, 1],
    [KW.DEF, 0],
    [KW.AP, 3],
    [KW.DIST, 1],
  ],
  Инженеры: [
    [KW.ATK, 1],
    [KW.DEF, 0],
    [KW.AP, 2],
  ],

  // машины
  Баллиста: [
    [KW.ATK, 3],
    [KW.DEF, 1],
    [KW.AP, 1],
    [KW.DIST, 2],
  ],
  Катапульта: [
    [KW.ATK, 0],
    [KW.DEF, 0],
  ],

  // звери
  Скот: [
    [KW.AP, 1],
    ['Еда', 1.6],
    [KW.REGEN, 1],
  ],
  Кони: [
    [KW.ATK, 1],
    [KW.DEF, 1],
    [KW.AP, 3],
    [KW.REGEN, 1],
  ],
  Зверь: [
    [KW.ATK, 2],
    [KW.DEF, 0],
    [KW.AP, 3],
    [KW.REGEN, 1],
  ],

  // корабли
  Корабль_1: [
    [KW.ATK, 2],
    [KW.DEF, 2],
    [KW.AP, 3],
    [KW.DIST, 0],
  ],
  Корабль_2: [
    [KW.ATK, 3],
    [KW.DEF, 3],
    [KW.AP, 2],
    [KW.DIST, 1],
  ],
  Корабль_3: [
    [KW.ATK, 4],
    [KW.DEF, 4],
    [KW.AP, 1],
    [KW.DIST, 2],
  ],

};

const TECH_EFFECTS = {
  "ЛЕС": {
    "1": [
      ":нейтральные Звери не атакуют",
      "Здание: Сад (производство Дерева за Еду на плодородной земле)",
      "НУЖНА ЕЩЕ ТЕХА?"
    ],
    "2": [
      "Лесопилка - +1 дерево",
      ":нейтральных Зверей можно приручать как Скот",
      ":Сад можно строить в Пустыне и Горах"
    ],
    "3": [
      ":Рядом с каждым Садом появляется стена",
      ":на Зверях можно ездить как на Лошадях",
      "Лесной оброк - +0.2 дерева за каждого жителя"
    ]
  },
  "СТРОИТЕЛЬСТВО": {
    "1": [
      "Здание: Город",
      "Юнит: Инженеры",
      "Юнит: Баллиста",
      "Юнит: Катапульта",
    ],
    "2": [
      ":Можно строить в радиусе 2 клеток от города",
      ":можно разбирать здания",
      "Здание: Акведук (На прилегающих гексах можно строить Фермы независимо от биома, должен начинаться от Гор)"
    ],
    "3": [
      ":Акведук можно вести от моря",
      ":Цена любого строительства -1 дерево",
      ":можно строить два здания на одной клетке"
    ]
  },
  "МОРЕ": {
    "1": [
      ":можно перевозить юниты с кораблями",
      "Здание: Порт",
      "НУЖНА ЕЩЕ ТЕХА?"
    ],
    "2": [
      ":можно строить Лагеря в прибрежных водах",
      "Юнит: Корабль 2",
      "Порт - Еда +2"
    ],
    "3": [
      ":можно строить Аванпосты, Фермы и Сады в океане",
      "Юнит: Корабль 3",
      "НУЖНА ЕЩЕ ТЕХА?"
    ]
  },
  "ГОСУДАРСТВО": {
    "1": [
      ":+1 Счастье, снижает шанс бунта при голоде",
      ":?можно строить Тюрьмы/если в городе есть военный юнит (убирает половину недовольства при его появлении, преобразуя во вдвое меньшее количество рабов, не более 1 в городе)",
      ":Разрешает судебные разбирательства"
    ],
    "2": [
      ":появляется Письменность",
      ":доступ к архивам: -1 к стоимости изучения технологий",
      "?Юнит: Бюрократ (не воюет, но может управлять аванпостами как временные столицы)"
    ],
    "3": []
  }
}