/* exported
DICT_USER USER_TECH_LVLS
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW
*/

const DICT_USER = {
  Нью_Лоуландс: {
    [KW.CAPITAL]:
      [
      ],
  },

  Мамонты: {
    [KW.CAPITAL]:
      [
      ],
  },

};

const USER_TECH_LVLS = {
  Мамонты: {
    МОЩЬ: 2,
    ХИТРОСТЬ: 0,
  },
  Нео: {
    МОЩЬ: 1,
    ХИТРОСТЬ: 0,
  },
  Чайки: {
    МОЩЬ: 1,
    ХИТРОСТЬ: 1,
  },
  Онид: {
    МОЩЬ: 0,
    ХИТРОСТЬ: 1,
    АЛМАЗНЫЕ_ГОРОДА: 1,
  },
  Йод: {
    МОЩЬ: 1,
    ХИТРОСТЬ: 0,
  },  
  Паксе: {
    МОЩЬ: 0,
    ХИТРОСТЬ: 0,
  }, 
  Эгмат: {
    МОЩЬ: 1,
    ХИТРОСТЬ: 1,
  }, 
  Авпац: {
    МОЩЬ: 0,
    ХИТРОСТЬ: 0,
  }, 
  Гешксен: {
    МОЩЬ: 0,
    ХИТРОСТЬ: 0,
  }, 
}
