/* exported
FACTIONS DICT_USER USER_TECH_LVLS
*/

/// <reference path="../../src/keywords.js"/>
/* global
KW
*/

/** colors only in lowercase! */
const FACTIONS = {
  "Онид": "#d3d3d3",
  "Йод": "#930000",
  "Мамонты": "#006699",
  "Нео": "#ff69b4",
  "Чайки": "#640cff",
  "Паксе": "#ffa500",
  "Эгмат": "#ff4500",
  "Авпац": "#9acd32",
  "Гешксен": "#808000"
}

const DICT_USER = {
  Нео: {
    _unit_: [
      // [KW.LVL_DRIFT, -1]
    ]
  },

  Мамонты: {
    [KW.CAPITAL]:
      [
      ],
  },

};

const USER_TECH_LVLS = {
  Мамонты: {
    МОЩЬ: 3,
    ХИТРОСТЬ: 0,
  },
  Нео: {
    МОЩЬ: 3,
    ХИТРОСТЬ: 0,
  },
  Чайки: {
    МОЩЬ: 1,
    ХИТРОСТЬ: 1,
  },
  Онид: {
    МОЩЬ: 0,
    ХИТРОСТЬ: 3,
    АЛМАЗНЫЕ_ГОРОДА: 2,
  },
  Йод: {
    МОЩЬ: 3,
    ХИТРОСТЬ: 0,
  },  
  Паксе: {
    МОЩЬ: 2,
    ХИТРОСТЬ: 0,
  }, 
  Эгмат: {
    МОЩЬ: 1,
    ХИТРОСТЬ: 1,
  }, 
  Авпац: {
    МОЩЬ: 2,
    ХИТРОСТЬ: 0,
  }, 
  Гешксен: {
    МОЩЬ: 2,
    ХИТРОСТЬ: 0,
  }, 
}
