/* exported 
DICT_COMMON DICT_USER EFFECT_LISTS DEFAULT
*/

const DEFAULT = {
  buildings: [
    'build_slot',
    'grave',
    'unknown_bonus',
    'Аванпост',
    'Деревня',
    'Город',
    'Столица',

    'Дом',
    'Склад',
    
    'Казарма',
    'Школа_шпионов',
    'Магическая_академия',

    // 'Мосты',
    // 'Дороги',
    // 'Стены',
    
    'Ферма',
    'Охотник',
    'Железная_шахта',
    'Каменоломня',
    'Лесопилка',

    'Госпиталь',
    'Кузница',
    'Уникальное_здание',
    // 'Ферма_водорослей',
  ],
  units: [
    'default_unit',
    'Пехота',
    'Стрелки',
    'Инженеры',
    'Маги',
    'Разведчики',
    'Шпион',
    'Элита',

    'Командир',
    'Зверь',
    'Шестеренка',
    // 'Дирижабль',
  ]
}

const EFFECT_LISTS = {
  global: [
    'Лимит населения',
    'Хранилище',
  ],
  // в смысле "добываются в зданиях"
  resources: [
    "Еда",
    "Железо",
    "Камень",
    "Дерево",
    // "Лошади",
  ],
  local: [],
}

const DICT_COMMON = {
  Столица: {
    // TODO add empire default values
    effects: [
      ["Хранилище", 30],
      ["Еда", 40],
    ]
  },
  Дом: {
    effects: [
      ["Лимит населения", 10],
    ]
  },
  Склад: {
    effects: [
      ["Хранилище", 10],
    ]
  },
  Железная_шахта: {
    effects: [
      ["Железо", 2],
    ]
  },
  Каменоломня: {
    effects: [
      ["Камень", 10],
    ]
  },
  Лесопилка: {
    effects: [
      ["Дерево", 10],
    ]
  },
  Ферма: {
    effects: [
      ["Еда", 6],
      // ["Лошади", 1],
    ]
  },
  Охотник: {
    effects: [
      ["Еда", 2],
    ]
  },
};

const DICT_USER = {
  Егг: {
    Столица: {
      effects: [
        ["Кристаллы", 2],
        ["Еда", 10],
      ]
    }
  },
  Кшиштоф: {
    Столица: {
      effects: [
        ["Кристаллы", 2],
        ["Еда", 10],
      ]
    }
  },
};