/* exported 
DICT_COMMON DICT_USER EFFECT_LISTS DEFAULT
*/

const DEFAULT = {
  buildings: [
    'build_slot',
    'grave',
    'unknown_bonus',
    'Аванпост',
    'Деревня',
    'Город',
    'Столица',

    'Дом',
    'Склад',

    'Казарма',
    'Школа_шпионов',
    'Магическая_академия',

    // 'Мосты',
    // 'Дороги',
    'Стена',

    'Ферма',
    'Охотник',
    'Железная_шахта',
    'Каменоломня',
    'Лесопилка',

    'Госпиталь',
    'Кузница',
    'Уникальное_здание',
    // 'Ферма_водорослей',
  ],
  units: [
    'default_unit',
    'Пехота',
    'Стрелки',
    'Инженеры',
    'Маги',
    'Разведчики',
    'Шпион',
    'Элита',

    'Командир',
    'Зверь',
    'Шестеренка',
    // 'Дирижабль',
  ],
}

const EFFECT_LISTS = {
  // статичные эффекты, нам важно текущее значение
  static: [
    'Лимит населения',
    'Хранилище',
  ],
  // добывается, фактически показывает прибыль ресурса
  resources: [
    "Еда",
    "Железо",
    "Камень",
    "Дерево",
    "Рабы",
    // "Лошади",
  ],
  local: [],
}

const DICT_COMMON = {
  _building_: [],
  _unit_: [
    ["Еда", -10]
  ],
  Столица:
    [
      ["Хранилище", 30],
      ["Еда", 40],
      ["Дерево", 3],
    ],

  Дом:
    [
      ["Лимит населения", 10],
    ],

  Склад:
    [
      ["Хранилище", 10],
    ],

  Магическая_академия:
    [
      ["Кристаллы", 1],
    ],

  Железная_шахта:
    [
      ["Железо", 2],
    ],

  Каменоломня:
    [
      ["Камень", 10],
    ],

  Лесопилка:
    [
      ["Дерево", 10],
    ],

  Ферма:
    [
      ["Еда", 6],
      // ["Лошади", 1],
    ],

  Охотник:
    [
      ["Еда", 2],
    ],

};

const DICT_USER = {
  Егг: {
    Столица:
      [
        ["Кристаллы", 2],
        ["Еда", 10],
      ],
  },

  Кшиштоф: {
    Столица:
      [
        ["Кристаллы", 2],
        ["Еда", 10],
      ],
  },

};
