/* exported 
DICT_COMMON DICT_USER EFFECT_LISTS
*/

const EFFECT_LISTS = {
  global: [
    'Лимит населения',
    'Хранилище',
  ],
  // в смысле "добываются в зданиях"
  resources: [
    "Железо",
    "Камень",
    "Дерево",
    "Еда",
    "Лошади",
  ],
  local: [],
}

const DICT_COMMON = {
  Столица: {
    // TODO add empire default values
    effects: [
      ["Хранилище", 15],
      ["Еда", 30],
    ]
  },
  Дом: {
    effects: [
      ["Лимит населения", 10],
    ]
  },
  Склад: {
    effects: [
      ["Хранилище", 10],
    ]
  },
  Железная_шахта: {
    effects: [
      ["Железо", 2],
    ]
  },
  Каменоломня: {
    effects: [
      ["Камень", 10],
    ]
  },
  Лесопилка: {
    effects: [
      ["Дерево", 10],
    ]
  },
  Ферма: {
    effects: [
      ["Еда", 2],
      ["Лошади", 1],
    ]
  },
};

const DICT_USER = {
  Егг: {
    Столица: {
      effects: [
        ["Кристаллы", 2],
        ["Еда", 10],
      ]
    }
  },
  Кшиштоф: {
    Столица: {
      effects: [
        ["Кристаллы", 2],
        ["Еда", 10],
      ]
    }
  },
};